In [424]:
import pandas as pd
import numpy as np

In [425]:
# %timeit np.arange(0,100,3,dtype=int).sum()

In [426]:
# %timeit np.arange(0,100,3,dtype=object).sum()

In [427]:
pd.Series([1,np.nan,2,3])

0    1.0
1    NaN
2    2.0
3    3.0
dtype: float64

In [428]:
data = pd.Series([1,np.nan,'hello',None])

In [429]:
data.isna()

0    False
1     True
2    False
3     True
dtype: bool

In [430]:
data.dropna()

0        1
2    hello
dtype: object

In [431]:
df = pd.DataFrame([[1,np.nan,2],
                     [2,3,5],
                     [np.nan,4,6]])

In [432]:
df.isna()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [433]:
df.dropna(axis = 0,how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [434]:
data = pd.Series([1,np.nan,2,None,3],index=list('abcde'),dtype='Int32')
data

a       1
b    <NA>
c       2
d    <NA>
e       3
dtype: Int32

In [435]:
data.bfill()

a    1
b    2
c    2
d    3
e    3
dtype: Int32

In [436]:
data.ffill()

a    1
b    1
c    2
d    2
e    3
dtype: Int32

In [437]:
df[0]

0    1.0
1    2.0
2    NaN
Name: 0, dtype: float64

In [438]:
df[0].fillna(df[0].mean(),inplace=True)
df[0]

0    1.0
1    2.0
2    1.5
Name: 0, dtype: float64

In [439]:
df = pd.DataFrame({
    'Courses':['Spark','Java','Scala','Python'],
    'Fee':[20000,np.nan,26000,24000],
    'Duration':['30 days','40 days','NA','40 days'],
    'Discount':[1000,np.nan,2500,None]
})
df

  Courses      Fee Duration  Discount
0   Spark  20000.0  30 days    1000.0
1    Java      NaN  40 days       NaN
2   Scala  26000.0       NA    2500.0
3  Python  24000.0  40 days       NaN

In [440]:
df.fillna(value={'Discount':0,'Fee':1000},)

  Courses      Fee Duration  Discount
0   Spark  20000.0  30 days    1000.0
1    Java   1000.0  40 days       0.0
2   Scala  26000.0       NA    2500.0
3  Python  24000.0  40 days       0.0

In [441]:
df = pd.read_csv("toyota.csv",index_col="Unnamed: 0",na_values=['??','????'])
df.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170

In [442]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [443]:
cars_data_2 = df.copy()
cars_data_3 = df.copy()

In [444]:
cars_data_2['KM'].replace("??",np.nan,inplace=True)
cars_data_2['HP'].replace("????",np.nan,inplace=True)

In [445]:
cars_data_2.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [446]:
cars_data_2.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Index: 1096 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1096 non-null   int64
 1   Age        1096 non-null   float64
 2   KM         1096 non-null   float64
 3   FuelType   1096 non-null   object
 4   HP         1096 non-null   float64
 5   MetColor   1096 non-null   float64
 6   Automatic  1096 non-null   int64
 7   CC         1096 non-null   int64
 8   Doors      1096 non-null   object
 9   Weight     1096 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 94.2+ KB

In [447]:
missing = cars_data_2[cars_data_2.isnull().any(axis=1)]
missing

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165
6,16900,27.0,NaN,Diesel,NaN,NaN,0,2000,3,1245
7,18600,30.0,75889.0,NaN,90.0,1.0,0,2000,3,1245
9,12950,23.0,71138.0,Diesel,NaN,NaN,0,1900,3,1105
15,22000,28.0,18739.0,Petrol,NaN,0.0,0,1800,3,1185
...,...,...,...,...,...,...,...,...,...,...
1428,8450,72.0,NaN,Petrol,86.0,NaN,0,1300,3,1015
1431,7500,NaN,20544.0,Petrol,86.0,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86.0,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86.0,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86.0,1.0,0,1300,3,1015

In [448]:
cars_data_2['Age'].fillna(cars_data_2['Age'].mean(),inplace=True)
cars_data_2['HP'].fillna(cars_data_2['HP'].mean(),inplace=True)
cars_data_2

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.000000,46986.0,Diesel,90.0,1.0,0,2000,three,1165
1,13750,23.000000,72937.0,Diesel,90.0,1.0,0,2000,3,1165
2,13950,24.000000,41711.0,Diesel,90.0,NaN,0,2000,3,1165
3,14950,26.000000,48000.0,Diesel,90.0,0.0,0,2000,3,1165
4,13750,30.000000,38500.0,Diesel,90.0,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,55.672156,20544.0,Petrol,86.0,1.0,0,1300,3,1025
1432,10845,72.000000,NaN,Petrol,86.0,0.0,0,1300,3,1015
1433,8500,55.672156,17016.0,Petrol,86.0,0.0,0,1300,3,1015
1434,7250,70.000000,NaN,NaN,86.0,1.0,0,1300,3,1015
1435,6950,76.000000,1.0,Petrol,110.0,0.0,0,1600,5,1114

In [449]:
cars_data_2['Age'].isna().sum()

0

In [450]:
cars_data_2['KM'].fillna(cars_data_2['KM'].median(),inplace=True)
cars_data_2['KM'] = cars_data_2['KM'].astype(int)
cars_data_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1436 non-null   float64
 2   KM         1436 non-null   int32
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int32(1), int64(4), object(2)
memory usage: 117.8+ KB

In [451]:
cars_data_2['FuelType'].value_counts()

FuelType
Petrol    1177
Diesel     144
CNG         15
Name: count, dtype: int64

In [452]:
cars_data_2['FuelType'].fillna(cars_data_2['FuelType'].value_counts().index[0],inplace=True)
cars_data_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1436 non-null   float64
 2   KM         1436 non-null   int32
 3   FuelType   1436 non-null   object
 4   HP         1436 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int32(1), int64(4), object(2)
memory usage: 117.8+ KB

In [453]:
cars_data_2['MetColor'].fillna(cars_data_2['MetColor'].median(),inplace=True)

In [454]:
cars_data_2.isnull().sum()

Price        0
Age          0
KM           0
FuelType     0
HP           0
MetColor     0
Automatic    0
CC           0
Doors        0
Weight       0
dtype: int64

In [455]:
cars_data_2['MetColor'].unique()

array([1., 0.])